# EncryptPlugin

## Description
Encrypt one VectorScript Plug-in file.

```pascal
FUNCTION EncryptPlugin(fullPath : STRING): BOOLEAN;
```

```python
def vs.EncryptPlugin(fullPath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fullPath|STRING|   |

## Remarks
This function is provided by an external plug-in that is not provided by the normal distribution of Vectorworks.

The plug-in is called ‘BatchEncryption’ and can be found inside ‘ToolsWin’ or ‘ToolsMac’ folders of the corresponding Vectorworks SDKs.

The Vectorworks SDK can be downloaded here:
http://www.vectorworks.net/support/custom/sdk/sdkdown.php

## See Also
EncryptAllPlugins

## Version
Availability: from Vectorworks 2014

## Category
* Utility